Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS4B.xml
          </instance>
        </module>
        <module name="PM" id="I7146" version="4.4.1">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x400E0000"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="AWEN_PICOUART" value="6"/>
              <param name="AWEN_TWIS0" value="0"/>
              <param name="AWEN_TWIS1" value="1"/>
              <param name="AWEN_USBC" value="2"/>
              <param name="MCCTRL_MCSEL_DFLL0" value="3"/>
              <param name="MCCTRL_MCSEL_FLO" value="7"/>
              <param name="MCCTRL_MCSEL_OSC0" value="1"/>
              <param name="MCCTRL_MCSEL_PLL0" value="2"/>
              <param name="MCCTRL_MCSEL_RCFAST" value="5"/>
              <param name="MCCTRL_MCSEL_RC1M" value="6"/>
              <param name="MCCTRL_MCSEL_RC80M" value="4"/>
              <param name="MCCTRL_MCSEL_SLOW" value="0"/>
              <param name="PM_CLK_APB_NUM" value="4"/>
              <param name="PPCR_FLASH_WAIT_BGREF_MASK" value="512"/>
              <param name="PPCR_FLASH_WAIT_BOD18_MASK" value="1024"/>
              <param name="PM_SMODE_DEEPSTOP" value="4"/>
              <param name="PM_SMODE_FROZEN" value="1"/>
              <param name="PM_SMODE_IDLE" value="0"/>
              <param name="PM_SMODE_SHUTDOWN" value="6"/>
              <param name="PM_SMODE_STANDBY" value="2"/>
              <param name="PM_SMODE_STATIC" value="5"/>
              <param name="PM_SMODE_STOP" value="3"/>
            </parameters>
            <clock-groups>
              <clock-group name="CPU" grouporder="0">
                <clock name="OCD" bit="0"/>
              </clock-group>
              <clock-group name="HSB" grouporder="1">
                <clock name="PDCA" bit="0"/>
                <clock name="HFLASHC" bit="1"/>
                <clock name="HRAMC1" bit="2"/>
                <clock name="USBC" bit="3"/>
                <clock name="CRCCU" bit="4"/>
                <clock name="HTOP0" bit="5"/>
                <clock name="HTOP1" bit="6"/>
                <clock name="HTOP2" bit="7"/>
                <clock name="HTOP3" bit="8"/>
              </clock-group>
              <clock-group name="PBA" grouporder="2">
                <clock name="IISC" bit="0"/>
                <clock name="SPI" bit="1"/>
                <clock name="TC0" bit="2"/>
                <clock name="TC1" bit="3"/>
                <clock name="TWIM0" bit="4"/>
                <clock name="TWIS0" bit="5"/>
                <clock name="TWIM1" bit="6"/>
                <clock name="TWIS1" bit="7"/>
                <clock name="USART0" bit="8"/>
                <clock name="USART1" bit="9"/>
                <clock name="USART2" bit="10"/>
                <clock name="USART3" bit="11"/>
                <clock name="ADCIFE" bit="12"/>
                <clock name="DACC" bit="13"/>
                <clock name="ACIFC" bit="14"/>
                <clock name="GLOC" bit="15"/>
                <clock name="ABDACB" bit="16"/>
                <clock name="TRNG" bit="17"/>
                <clock name="PARC" bit="18"/>
                <clock name="CATB" bit="19"/>
                <clock name="TWIM2" bit="21"/>
                <clock name="TWIM3" bit="22"/>
              </clock-group>
              <clock-group name="PBB" grouporder="3">
                <clock name="HFLASHC" bit="0"/>
                <clock name="HCACHE" bit="1"/>
                <clock name="HMATRIX" bit="2"/>
                <clock name="PDCA" bit="3"/>
                <clock name="CRCCU" bit="4"/>
                <clock name="USBC" bit="5"/>
                <clock name="PEVC" bit="6"/>
              </clock-group>
              <clock-group name="PBC" grouporder="4">
                <clock name="PM" bit="0"/>
                <clock name="CHIPID" bit="1"/>
                <clock name="SCIF" bit="2"/>
                <clock name="FREQM" bit="3"/>
                <clock name="GPIO" bit="4"/>
              </clock-group>
              <clock-group name="PBD" grouporder="5">
                <clock name="BPM" bit="0"/>
                <clock name="BSCIF" bit="1"/>
                <clock name="AST" bit="2"/>
                <clock name="WDT" bit="3"/>
                <clock name="EIC" bit="4"/>
                <clock name="PICOUART" bit="5"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="SCIF" id="I7149" version="1.3.0">
          <instance name="SCIF">
            <register-group name="SCIF" name-in-module="SCIF" address-space="base" offset="0x400E0800"/>
            <signals>
              <signal group="GCLK" index="0" function="E" pad="PA19"/>
              <signal group="GCLK" index="0" function="E" pad="PB10"/>
              <signal group="GCLK" index="0" function="E" pad="PC26"/>
              <signal group="GCLK" index="0" function="A" pad="PA02"/>
              <signal group="GCLK" index="1" function="E" pad="PA20"/>
              <signal group="GCLK" index="1" function="E" pad="PB11"/>
              <signal group="GCLK" index="1" function="E" pad="PC27"/>
              <signal group="GCLK" index="2" function="E" pad="PB12"/>
              <signal group="GCLK" index="2" function="E" pad="PC28"/>
              <signal group="GCLK" index="3" function="E" pad="PB13"/>
              <signal group="GCLK" index="3" function="E" pad="PC29"/>
              <signal group="GCLK_IN" index="0" function="E" pad="PA23"/>
              <signal group="GCLK_IN" index="0" function="E" pad="PB14"/>
              <signal group="GCLK_IN" index="0" function="E" pad="PC30"/>
              <signal group="GCLK_IN" index="1" function="E" pad="PA24"/>
              <signal group="GCLK_IN" index="1" function="E" pad="PB15"/>
              <signal group="GCLK_IN" index="1" function="E" pad="PC31"/>
              <signal group="XIN0" function="XIN0" pad="PA00"/>
              <signal group="XOUT0" function="XOUT0" pad="PA01"/>
            </signals>
            <parameters>
              <param name="BOD33_IMPLEMENTED" value="0"/>
              <param name="BOD50_IMPLEMENTED" value="0"/>
              <param name="BR_NUM" value="0"/>
              <param name="DFLL_CALIB_MSB" value="3"/>
              <param name="DFLL_COARSE_MSB" value="4"/>
              <param name="DFLL_FINE_MSB" value="7"/>
              <param name="DFLL_RANGE_MSB" value="1"/>
              <param name="GCLK_EXTCLK_MSB" value="3"/>
              <param name="GCLK_IN_MSB" value="1"/>
              <param name="GCLK_IN_NUM" value="2"/>
              <param name="GCLK_MSB" value="10"/>
              <param name="GCLK_NUM" value="12"/>
              <param name="GCLK_NUM_DFLL_REF" value="0"/>
              <param name="GCLK_NUM_DFLL_SSG" value="1"/>
              <param name="GCLK_NUM_FLO" value="4"/>
              <param name="GCLK_NUM_MASTER" value="11"/>
              <param name="GCLK_NUM_PLL" value="9"/>
              <param name="GCLK_NUM_RC32KIFB_REF" value="5"/>
              <param name="GC_USES_CLK_CPU" value="7"/>
              <param name="GC_USES_CLK_HSB" value="8"/>
              <param name="GC_USES_CLK_PBA" value="9"/>
              <param name="GC_USES_CLK_PBB" value="10"/>
              <param name="GC_USES_CLK_PBC" value="11"/>
              <param name="GC_USES_CLK_PBD" value="12"/>
              <param name="GC_USES_CLK_SLOW" value="0"/>
              <param name="GC_USES_CLK_1K" value="15"/>
              <param name="GC_USES_CLK_32" value="1"/>
              <param name="GC_USES_DFLL0" value="2"/>
              <param name="GC_USES_FLO" value="14"/>
              <param name="GC_USES_GCLKPRESC_FP" value="18"/>
              <param name="GC_USES_GCLKPRESC_HRP" value="17"/>
              <param name="GC_USES_GCLK_IN0" value="19"/>
              <param name="GC_USES_GCLK_IN1" value="20"/>
              <param name="GC_USES_MASTER" value="21"/>
              <param name="GC_USES_OSC0" value="3"/>
              <param name="GC_USES_PLL0" value="16"/>
              <param name="GC_USES_RCFAST" value="5"/>
              <param name="GC_USES_RC1M" value="6"/>
              <param name="GC_USES_RC32K" value="13"/>
              <param name="GC_USES_RC80M" value="4"/>
              <param name="OSC_NUM" value="1"/>
              <param name="PLL_NUM" value="1"/>
              <param name="RCFAST_CALIBRATION_MSB" value="6"/>
              <param name="RCFAST_FRANGE_MSB" value="1"/>
              <param name="RCOSC_FREQUENCY" value="115200"/>
              <param name="RC80M_CALIBRATION_MSB" value="1"/>
              <param name="BOD_OFF" value="0"/>
              <param name="BOD_ON" value="1"/>
              <param name="BOD_ON_NORESET" value="2"/>
              <param name="GC_DIV_CLOCK" value="1"/>
              <param name="GC_NO_DIV_CLOCK" value="0"/>
            </parameters>
          </instance>
        </module>
