Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS4B.xml
        <register name="UPSTA5SET" offset="0x5a4" rw="W" size="4" initval="0x00000000" caption="Pipe Status Set Register">
          <bitfield name="RXINIS" caption="RXINI Set" mask="0x1"/>
          <bitfield name="TXOUTIS" caption="TXOUTI Set" mask="0x2"/>
          <bitfield name="TXSTPIS" caption="TXSTPI Set" mask="0x4"/>
          <bitfield name="PERRIS" caption="PERRI Set" mask="0x8"/>
          <bitfield name="NAKEDIS" caption="NAKEDI Set" mask="0x10"/>
          <bitfield name="ERRORFIS" caption="ERRORFI Set" mask="0x20"/>
          <bitfield name="RXSTALLDIS" caption="RXSTALLDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x400"/>
        </register>
        <register name="UPSTA6SET" offset="0x5a8" rw="W" size="4" initval="0x00000000" caption="Pipe Status Set Register">
          <bitfield name="RXINIS" caption="RXINI Set" mask="0x1"/>
          <bitfield name="TXOUTIS" caption="TXOUTI Set" mask="0x2"/>
          <bitfield name="TXSTPIS" caption="TXSTPI Set" mask="0x4"/>
          <bitfield name="PERRIS" caption="PERRI Set" mask="0x8"/>
          <bitfield name="NAKEDIS" caption="NAKEDI Set" mask="0x10"/>
          <bitfield name="ERRORFIS" caption="ERRORFI Set" mask="0x20"/>
          <bitfield name="RXSTALLDIS" caption="RXSTALLDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x400"/>
        </register>
        <register name="UPSTA7SET" offset="0x5ac" rw="W" size="4" initval="0x00000000" caption="Pipe Status Set Register">
          <bitfield name="RXINIS" caption="RXINI Set" mask="0x1"/>
          <bitfield name="TXOUTIS" caption="TXOUTI Set" mask="0x2"/>
          <bitfield name="TXSTPIS" caption="TXSTPI Set" mask="0x4"/>
          <bitfield name="PERRIS" caption="PERRI Set" mask="0x8"/>
          <bitfield name="NAKEDIS" caption="NAKEDI Set" mask="0x10"/>
          <bitfield name="ERRORFIS" caption="ERRORFI Set" mask="0x20"/>
          <bitfield name="RXSTALLDIS" caption="RXSTALLDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x400"/>
        </register>
        <register name="UPCON0" offset="0x5c0" rw="R" size="4" initval="0x00000000" caption="Pipe Control Register">
          <bitfield name="RXINE" caption="RXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="TXOUTE" caption="TXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="TXSTPE" caption="TXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="PERRE" caption="PERR Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKEDE" caption="NAKED Interrupt Enable" mask="0x10"/>
          <bitfield name="ERRORFIE" caption="ERRORFI Interrupt Enable" mask="0x20"/>
          <bitfield name="RXSTALLDE" caption="RXTALLD Interrupt Enable" mask="0x40"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x400"/>
          <bitfield name="NBUSYBKE" caption="NBUSYBKInterrupt Enable" mask="0x1000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="PFREEZE" caption="Pipe Freeze" mask="0x20000"/>
          <bitfield name="INITDTGL" caption="Data Toggle Initialization" mask="0x40000"/>
          <bitfield name="INITBK" caption="Bank Initialization" mask="0x80000"/>
        </register>
        <register name="UPCON1" offset="0x5c4" rw="R" size="4" initval="0x00000000" caption="Pipe Control Register">
          <bitfield name="RXINE" caption="RXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="TXOUTE" caption="TXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="TXSTPE" caption="TXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="PERRE" caption="PERR Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKEDE" caption="NAKED Interrupt Enable" mask="0x10"/>
          <bitfield name="ERRORFIE" caption="ERRORFI Interrupt Enable" mask="0x20"/>
          <bitfield name="RXSTALLDE" caption="RXTALLD Interrupt Enable" mask="0x40"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x400"/>
          <bitfield name="NBUSYBKE" caption="NBUSYBKInterrupt Enable" mask="0x1000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="PFREEZE" caption="Pipe Freeze" mask="0x20000"/>
          <bitfield name="INITDTGL" caption="Data Toggle Initialization" mask="0x40000"/>
          <bitfield name="INITBK" caption="Bank Initialization" mask="0x80000"/>
        </register>
        <register name="UPCON2" offset="0x5c8" rw="R" size="4" initval="0x00000000" caption="Pipe Control Register">
          <bitfield name="RXINE" caption="RXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="TXOUTE" caption="TXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="TXSTPE" caption="TXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="PERRE" caption="PERR Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKEDE" caption="NAKED Interrupt Enable" mask="0x10"/>
          <bitfield name="ERRORFIE" caption="ERRORFI Interrupt Enable" mask="0x20"/>
          <bitfield name="RXSTALLDE" caption="RXTALLD Interrupt Enable" mask="0x40"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x400"/>
          <bitfield name="NBUSYBKE" caption="NBUSYBKInterrupt Enable" mask="0x1000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="PFREEZE" caption="Pipe Freeze" mask="0x20000"/>
          <bitfield name="INITDTGL" caption="Data Toggle Initialization" mask="0x40000"/>
          <bitfield name="INITBK" caption="Bank Initialization" mask="0x80000"/>
        </register>
        <register name="UPCON3" offset="0x5cc" rw="R" size="4" initval="0x00000000" caption="Pipe Control Register">
          <bitfield name="RXINE" caption="RXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="TXOUTE" caption="TXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="TXSTPE" caption="TXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="PERRE" caption="PERR Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKEDE" caption="NAKED Interrupt Enable" mask="0x10"/>
          <bitfield name="ERRORFIE" caption="ERRORFI Interrupt Enable" mask="0x20"/>
          <bitfield name="RXSTALLDE" caption="RXTALLD Interrupt Enable" mask="0x40"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x400"/>
          <bitfield name="NBUSYBKE" caption="NBUSYBKInterrupt Enable" mask="0x1000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="PFREEZE" caption="Pipe Freeze" mask="0x20000"/>
          <bitfield name="INITDTGL" caption="Data Toggle Initialization" mask="0x40000"/>
          <bitfield name="INITBK" caption="Bank Initialization" mask="0x80000"/>
        </register>
